In [3]:
import pandas as pd
from sqlalchemy import create_engine

engine = create_engine('sqlite:///sqlite_db_pythonsqlite.db')

In [10]:
Q10 = """
WITH B AS (SELECT B.facid, SUM(CASE WHEN B.memid = 0 THEN F.guestcost * B.slots
                               ELSE F.membercost * B.slots END) AS revenue
            FROM Facilities AS F
            INNER JOIN Bookings AS B
            USING(facid)
            GROUP BY B.facid)
SELECT F.name, B.revenue
FROM Facilities AS F
INNER JOIN B
USING(facid)
WHERE B.revenue < 1000
ORDER BY revenue;
"""


revanue_sub1000 = pd.read_sql_query(Q10, engine)

print(revanue_sub1000)

            name  revenue
0   Table Tennis      180
1  Snooker Table      240
2     Pool Table      270

In [21]:
Q11 = '''
SELECT M1.surname, M1.firstname, M2.surname AS Recomender_sur, M2.firstname AS Recomender_first
FROM Members AS M1
INNER JOIN Members AS M2
ON M1.recommendedby = M2.memid
ORDER BY M1.surname, M1.firstname
'''

recomenders = pd.read_sql_query(Q11, engine)

print(recomenders)

              surname  firstname Recomender_sur Recomender_first
0               Bader   Florence       Stibbons           Ponder
1               Baker       Anne       Stibbons           Ponder
2               Baker    Timothy        Farrell           Jemima
3              Boothe        Tim         Rownam              Tim
4             Butters     Gerald          Smith           Darren
5              Coplin       Joan          Baker          Timothy
6             Crumpet      Erica          Smith            Tracy
7                Dare      Nancy       Joplette           Janice
8             Genting    Matthew        Butters           Gerald
9                Hunt       John        Purview        Millicent
10              Jones      David       Joplette           Janice
11              Jones    Douglas          Jones            David
12           Joplette     Janice          Smith           Darren
13          Mackenzie       Anna          Smith           Darren
14               Owen    Charles          Smith           Darren
15             Pinker      David        Farrell           Jemima
16            Purview  Millicent          Smith            Tracy
17             Rumney  Henrietta        Genting          Matthew
18             Sarwin  Ramnaresh          Bader         Florence
19              Smith       Jack          Smith           Darren
20           Stibbons     Ponder          Tracy           Burton
21  Worthington-Smyth      Henry          Smith            Tracy

In [23]:
Q12 = '''
SELECT F.name, SUM(slots) AS total_usage
FROM Facilities AS F
INNER JOIN (SELECT B.facid, slots FROM
            Bookings AS B
            WHERE memid != 0) AS Bk
USING (facid)
GROUP BY F.name
'''

member_usage = pd.read_sql_query(Q12, engine)

print(member_usage)

              name  total_usage
0  Badminton Court         1086
1   Massage Room 1          884
2   Massage Room 2           54
3       Pool Table          856
4    Snooker Table          860
5     Squash Court          418
6     Table Tennis          794
7   Tennis Court 1          957
8   Tennis Court 2          882

In [29]:
Q13 = '''
SELECT F.name, Bk.month, SUM(slots) AS total_usage
FROM Facilities AS F
INNER JOIN (SELECT B.facid, slots, strftime('%m', starttime) AS month 
            FROM Bookings AS B
            WHERE memid != 0) AS Bk
USING (facid)
GROUP BY F.name, month
'''

member_usage_by_month = pd.read_sql_query(Q13, engine)

print(member_usage_by_month)

               name month  total_usage
0   Badminton Court    07          165
1   Badminton Court    08          414
2   Badminton Court    09          507
3    Massage Room 1    07          166
4    Massage Room 1    08          316
5    Massage Room 1    09          402
6    Massage Room 2    07            8
7    Massage Room 2    08           18
8    Massage Room 2    09           28
9        Pool Table    07          110
10       Pool Table    08          303
11       Pool Table    09          443
12    Snooker Table    07          140
13    Snooker Table    08          316
14    Snooker Table    09          404
15     Squash Court    07           50
16     Squash Court    08          184
17     Squash Court    09          184
18     Table Tennis    07           98
19     Table Tennis    08          296
20     Table Tennis    09          400
21   Tennis Court 1    07          201
22   Tennis Court 1    08          339
23   Tennis Court 1    09          417
24   Tennis Court 2    07          123
25   Tennis Court 2    08          345
26   Tennis Court 2    09          414